Osmax-Br/time_keeper_esp32/main.cpp
#include <Arduino.h>
#include "ESPAsyncWebServer.h"
#include <press.h> // for multiple buttons regestration
//#include <ArduinoJson.h>
#include <HTTPClient.h>
#include <WiFi.h>
#include <WiFiClient.h>
#include <WiFiServer.h>
//#include <WiFiUdp.h>
//#include <NTPClient.h>
//#include <SPI.h>
//#include <Wire.h>
//#include <WiFiUdp.h>
#include "html.h" // the website code
#include <Adafruit_GFX.h>
#include <Adafruit_SSD1306.h>
#include <ESP32Time.h> // for using the internal rtc
#include <IRremote.hpp>
#include "DHT.h"

//******************************
// dht int
#define DHTPIN 13
#define DHTTYPE DHT11
DHT dht(DHTPIN, DHTTYPE);
int last_temp_update = 0;
float temperature,humidity,heat_index = 0;
/*

INSERT INTO activities (chosen_activity,hours_passed,minutes_passed,seconds_passed,activity_date_month,activity_date_day_number,activity_date_weekday,activity_date_hour,activity_date_minute)
      VALUES ('Paul', 32, 32, 32 , 1 ,1 , "wed" ,1 ,1 );
*/
//**********************************************

//oled screen init
#define SCREEN_WIDTH 128
#define SCREEN_HEIGHT 64
#define OLED_RESET     -1
#include <Fonts/FreeMonoBoldOblique9pt7b.h>
#include <Fonts/FreeMono9pt7b.h>
Adafruit_SSD1306 display(SCREEN_WIDTH, SCREEN_HEIGHT, &Wire, OLED_RESET);
int last_time_screen_on = 0;
bool time_critical = false ; // for not turning the screen off while uploading

//************************************************
//ui vars
String chosen_value = "Nothing"; //the chosen value from the grid
int select_mode = 0 ; //for maniging selection ways || 0 main screen , 1 grid selection , 2 , 3 screen off , 4 drop down menu , 5 error message
int filled_rect = -1 ; //for inverting text
int table[12][2] = {{0, 0}, {1, 0}, {2, 0}, {0, 1}, {1, 1}, {2, 1}, {0,2}, {1,2}, {2,2}, {0,3}, {1,3}, {2,3}}; //for storing the coordinats of each square in the grid
const int pages = 4; // ui pages number
int current_page = 0; // for navigation
String str[pages][12] = {{"school","mosque","sleep","musiq","eat","anime","bath","out","face","utube","quran","study"},
{"arabic","french","math","phys","chimst","scienc","draw","cf","python","esp32","book","minec"},
{"tidy","fix","souq","/","/","/","famlyM","famlyF","edit","cook","/","/"},
{"/","/","/","/","/","/","/","/","/","/","/","/"}};
int rect_cord[4][3][4] = {{{0,0,43,18},{42,0,43,18},{84,0,43,18}},{{0,17,43,18},{42,17,43,18},{84,17,43,18}},{{0,33,43,17},{42,33,43,17},{84,33,43,17}},{{0,49,43,15},{42,49,43,15},{84,49,43,15}}};  //the data of each rectangular in the grid eg: width,height,x,y
int lastpress,press_state = 0; //for button class
int cursor[2] = {0,0} ; //the cursor for grid the bottom-left rect is the 0,0 
String error_message_text = "" ;
int last_select_mode = 0; // this is for error message to return to last screen
bool ir_long_press = false;
String temp_button_return = "";
int last_time_long_press_mode = 0;
bool ok_cancel_button = true ; // left = ok = true
//************************************************************
// rtc vars

ESP32Time rtc(3600); // utc time offset , here in Syria it is 1 hour = 3600 sec
bool rtc_time_updated = false;  // for not updating the time twice from the internet
int last_rtc_update = 0;


//**************************************************************
//network credentials
const char *ssid     = "lemone"; 
const char *password = "Hta87#Mi00";
// for setting specific ip address
IPAddress local_IP(192, 168, 1, 199); //192.168.1.199
IPAddress gateway(192, 168, 1, 1);
IPAddress subnet(255, 255, 0, 0);
IPAddress primaryDNS(8, 8, 8, 8);   //optional
IPAddress secondaryDNS(8, 8, 4, 4); //optional
int connection_begin = 0; //knowing the last time the device attempted to connect to wifi



//***************************************************************
//buttons vars
//making button clases , each button is a spereate object
button_press button_up(35);
button_press button_down(34);
button_press button_right(33);
button_press button_left(32);
button_press button_selecT(27);
String up,down,right,left,selecT = "" ; // strores button values
int up_bounce,down_bounce,righ_bounce,left_bounce,selecT_bounce = 0;  // stores bounce press values
int last_press_time = 0;   //ignoring multiple presses at the same time for press function
//****************************************************************
// internal rtc timer vars

hw_timer_t * timer = NULL; //setting up the timer
volatile int seconds_passed; // storing the counter seconds in SRAM for faster execution
portMUX_TYPE timerMux = portMUX_INITIALIZER_UNLOCKED;
volatile int minutes_passed,hours_passed = 0; //storing the counter values
char time_counter_string[100] ;  // storing the formatted counter time
volatile bool paused = true ; // for pausing timer



//**************************************************************
//storage vars
int data_storage[4][12][3] ;
int data_storage_index = 0;


//****************************************************************
// web server vars
bool server_started = false ;
WiFiClient  clientt;
AsyncWebServer server(80);
String timer_web_var(){
  return time_counter_string;
}

String chosen_value_web_var(){
  return chosen_value;

}
String pause_web_var(){
  if(paused == true){
    if(data_storage[current_page][data_storage_index][0] == 0 && data_storage[current_page][data_storage_index][1] && data_storage[current_page][data_storage_index][2]){
      return "Start";}
    else{  
    return "Resume";}
  }
  else if(paused == false ){
    return "Pause";
  }
 else{
  return "ERROR !";
 } 
}
String var_processor(const String& var){
  if(var == "Timer"){
    return timer_web_var();
  }
  else if(var == "Chosen_server"){
    return chosen_value_web_var();
    }
  else if(var == "Pause"){
    return pause_web_var();
    }  
  return String();
}
//**************************************************************
//multi-tasking
TaskHandle_t ntp_time;  // getting the tine from internet 


//************************************************************
// sql vars
//String sql_server_string = "http://192.168.1.11/esp32sql/data_base_script.php"; 
const char* sql_server = "http://192.168.1.11/esp32sql/data_base_script.php"; 



//********************************************************
//drop screen vars
String options_list[4][4] = {{"End day&upload","change location","turn server off","change clock"},{"ssid","password","server","screen turn off"},{"alarm","email","reset activity","test rgb"},{"","","",""}};
int scroll_bar_place = 1;
int options_outer_counter = 0;
int block_cursor = 0;
int options_select_mode = 0 ;
// 0 = menu , 1 = end&upload ....etc

int get_date_cursor = 0 ; // 0 right , 1 left
bool got_the_date_from_db = false ;
String current_get_day_and_month ;


//******************************************************
//rgb led vars
#define PIN_RED    15 // GPIO23
#define PIN_GREEN  25 // GPIO22
#define PIN_BLUE   12 // GPIO21
//                       red 0      green 1   blue2     yellow 3    cyan 4      maginta 5   pink 6     off 7
int rgb_values[15][3] = {{255,0,0},{0,255,0},{0,0,255},{250,100,3},{7,245,201},{180,7,245},{245,7,75},{0,0,0}};
String rgb_values_name[15] = {"Red","Green","Blue","Yellow","Cyan","Maginta","Pink","Off"};
int current_rgb = 0;







void rgb_display(int rgb_value_index){
    analogWrite(PIN_RED,255 - rgb_values[rgb_value_index][0]);
    analogWrite(PIN_GREEN,255 - rgb_values[rgb_value_index][1]);
    analogWrite(PIN_BLUE,255 - rgb_values[rgb_value_index][2]);

