Osmax-Br/time_keeper_esp32/main.cpp
}





// must add last_time var
void post(int page , int activity , int day_of_upload , int month_of_upload , int year_of_upload) { // for pushing the data into the sqlite data base on the pc
// on pc I used wimp to host a server
 // http post
    if(WiFi.status()== WL_CONNECTED){ 
      HTTPClient http;
      
      String s = sql_server;
      http.begin(s.c_str());
      	
      http.addHeader("Content-Type", "application/x-www-form-urlencoded"); //Specify content-type header
     
     char post_message[2000] ; //storing the post message                                                                                                                                                                                                                                //rtc.getTime("%I:%M:%S %p %a %d/%m")
     // should change the values in the next line to varaibles
     sprintf(post_message,"chosen_activity=%s&hours_passed=%i&minutes_passed=%i&seconds_passed=%i&activity_date_month=%i&activity_date_day_number=%i&activity_date_weekday=%s&activity_date_hour=%s&activity_date_minute=%s&activity_date_year=%i",str[page][activity],data_storage[page][activity][2],data_storage[page][activity][1],data_storage[page][activity][0],month_of_upload,day_of_upload,rtc.getTime("%a"),rtc.getTime("%H"),rtc.getTime("%M"),year_of_upload);
      int httpResponseCode = http.POST(post_message);   
      if(httpResponseCode>0){
  
    String response = http.getString();  //Get the response to the request
    Serial.println(response);
    }
    Serial.print(httpResponseCode);
    /* else{
          last_select_mode = select_mode;
          select_mode = 5;
          error_message_text = "error during upload";
          options_select_mode = 0;
          last_press_time = millis();
      }*/
      http.end();
    }}

String get(){
  String return_var = "";
      if(WiFi.status() != WL_CONNECTED){
          last_select_mode = select_mode;
          select_mode = 5;
          error_message_text = "connect to wifi";
          options_select_mode = 0;
          last_press_time = millis();

    }
if(WiFi.status()== WL_CONNECTED){
      HTTPClient http;

      String serverPath = sql_server;
      
      // Your Domain name with URL path or IP address with path
      http.begin(serverPath.c_str());
      // Send HTTP GET request
      int httpResponseCode = http.GET();
      if (httpResponseCode>0) {
      
        String payload = http.getString();
        return_var = payload ;
      
      }
      else {
        
      }
      // Free resources
      http.end();
    }

  return return_var;

}





void web_server(){
  
  server.on("/", HTTP_GET, [](AsyncWebServerRequest *request){
    request->send_P(200, "text/html", index_html, var_processor);
  });
  
  server.on("/timer", HTTP_GET, [](AsyncWebServerRequest *request){
    request->send_P(200, "text/plain", timer_web_var().c_str());
  });
   server.on("/chosen_server", HTTP_GET, [](AsyncWebServerRequest *request){
    request->send_P(200, "text/plain", chosen_value_web_var().c_str());
  });
    server.on("/Pause", HTTP_GET, [] (AsyncWebServerRequest *request) {
    request->send(200, "text/plain", "ok");
  });
  server.on("/btn", HTTP_GET, [](AsyncWebServerRequest *request){
    request->send_P(200, "text/plain", pause_web_var().c_str());
  });
  server.on("/Resume", HTTP_GET, [] (AsyncWebServerRequest *request) {
    request->send(200, "text/plain", "ok");
  });
   server.on("/PauseBtn", HTTP_GET, [] (AsyncWebServerRequest *request) {
    if(paused==true && chosen_value != "Nothing"){
        paused = false;
      }
    else if(paused == false){
        paused = true;
      } 
    
    request->send(200, "text/plain", "ok");
  });
  server.on("/choseee", HTTP_GET, [] (AsyncWebServerRequest *request) {
    String inputMessage = "";
    String inputParam;
    // GET input1 value on <ESP_IP>/get?input1=<inputMessage>
    if (request->hasParam("input1")) {
      inputMessage = request->getParam("input1")->value();
      inputParam = "input1";
     int chosen_value_index = 0; // for chosing the value index from str array (activity) 
      for(int i =0 ; i<12 ;i++){
      if(str[3][i] == "/"){
        chosen_value_index = i;
        break;
     }}
    // must put semaphore
    current_page = 3 ;
    str[3][chosen_value_index] = inputMessage;
    chosen_value = str[3][chosen_value_index];
      }
    request->send(200, "text/html", " <meta http-equiv='refresh' content='0; URL=http://192.168.1.199/'> ");
  });
 
  server.begin();
}


// error message function
void error_message(String error_text_message,int last_select_mode){
  if(select_mode == 5){
  rgb_display(0);
  display.setTextSize(1);
  display.setTextColor(WHITE);
  display.setCursor(0,0);
  display.print(error_text_message);
  display.drawRect(40,45,50,15,WHITE); 
  display.setCursor(60,48);
  display.print("ok");
  display.display();
  
  if(selecT == "pressed" && millis() > last_press_time + 100){
    display.clearDisplay();
    select_mode = last_select_mode;
    last_select_mode = 0;
    last_press_time = millis();
    return ;
  }
}}




void ir_button(){//32086590080
    if(IrReceiver.decodedIRData.decodedRawData == 3208659008){ 
  
  if(ir_long_press == false){
  ir_long_press = true;
  last_time_long_press_mode = millis();
  IrReceiver.decodedIRData.decodedRawData = 0;
  }
  else if(ir_long_press == true){
  ir_long_press = false;
  IrReceiver.decodedIRData.decodedRawData = 0;
  }
  

}




if(ir_long_press == false){
  temp_button_return = "pressed";
  rgb_display(7);
  
}
else{
  temp_button_return = "long_pressed";
  rgb_display(4);
  
}


if(millis() > last_time_long_press_mode + 10000 && ir_long_press == true){
    rgb_display(7);
    last_time_long_press_mode = millis();
    ir_long_press = false;
}
//Serial.print(temp_button_return);


if(IrReceiver.decodedIRData.decodedRawData == 4060954688){ 
  selecT = temp_button_return;
  if(temp_button_return = "long_pressed"){
    ir_long_press = 0;
  }
  IrReceiver.decodedIRData.decodedRawData = 0;
}
if(IrReceiver.decodedIRData.decodedRawData == 4094378048){
        up = temp_button_return; 
          if(temp_button_return = "long_pressed"){
            ir_long_press = 0;}
        IrReceiver.decodedIRData.decodedRawData = 0;
}
if(IrReceiver.decodedIRData.decodedRawData == 4044243008){
        down = temp_button_return;
          if(temp_button_return = "long_pressed"){
          ir_long_press = 0;} 
        IrReceiver.decodedIRData.decodedRawData = 0;
}
if(IrReceiver.decodedIRData.decodedRawData == 3994107968){
        right = temp_button_return; 
        if(temp_button_return = "long_pressed"){
        ir_long_press = 0;}
        IrReceiver.decodedIRData.decodedRawData = 0;
}
if(IrReceiver.decodedIRData.decodedRawData == 4010819648){
        left = temp_button_return; 
        if(temp_button_return = "long_pressed"){
        ir_long_press = 0;
  }
        IrReceiver.decodedIRData.decodedRawData = 0;
}




  if (IrReceiver.decode()) {

