Osmax-Br/time_keeper_esp32/main.cpp
}

void temp_screen(){
  display.clearDisplay();

  if(millis() > last_temp_update + 2000){
    humidity = dht.readHumidity();
    temperature = dht.readTemperature();
    heat_index = dht.computeHeatIndex(temperature, humidity, false);
    last_temp_update = millis();
}

//sprintf(temp_temp_print,"I %.01f C%c , H %.01f %%",heat_index,(char)247,humidity);
    display.setCursor(0,0);
    display.setTextSize(1);
    display.print("TEMP  ");
    display.setTextSize(2);
    display.printf("%.01f C%c",temperature,(char)247);
    display.setCursor(0,25);
    display.setTextSize(1);
    display.print("HUMID  ");
    display.setTextSize(2);
    display.printf("%.01f %%",humidity);
    display.setCursor(0,50);
    display.setTextSize(1);
    display.print("INDEX ");
    display.setTextSize(2);
    display.printf("%.01f C%c",heat_index,(char)247);
    if(heat_index >= 30){
        rgb_display(0);
    }
    else{
        rgb_display(1);
    }
    display.display();
}

void drop_screen(){
  if(options_select_mode == 0){ // main options menu
  display.setTextSize(1);
  // rect loop
  for(int i =0 ;i<=4 ; i++){
    if(i==block_cursor){  // fill the rect white when cursor passes
      display.fillRect(0,16*i,110,16,WHITE);
    }
    else{
      display.drawRect(0,16*i,110,16,WHITE);}
      }
  int options_inner_counter = 0;   // internal var only , for inverting text color
  //text loop
  for(int i=5;i<=50;i+=15){
     display.setCursor(9,i+1);
     if(options_inner_counter == block_cursor){ //when cursor passes make rect text black
      display.setTextColor(BLACK);
     }
     else{
      display.setTextColor(WHITE);  // inverting text
     }
    display.print(options_list[options_outer_counter][options_inner_counter]);  // print option labels
    options_inner_counter++;  // print next label inside the same page
    }
  
  
  for(int i=0 ; i <=64 ; i+=8){   // the dots
    display.fillRect(122,i,2,2,WHITE);
          }
// move up
  if(up == "pressed"){
    if(options_outer_counter + block_cursor != 0){  //for not going outside the screen
    block_cursor --;}// move up


    if(block_cursor == -1  && scroll_bar_place !=1){  // change page
      block_cursor = 3; //the last option of the previous page
    scroll_bar_place -= 10; // change the scroll_bar
    options_outer_counter--;} // change page
  }

// move down (same way)
  if(down == "pressed"){
    if(options_outer_counter == 3 && block_cursor ==3){

    }
    else{
    block_cursor ++ ;}
    if(block_cursor == 4  && scroll_bar_place != 31 && options_outer_counter != 4){
      block_cursor = 0;
    scroll_bar_place += 10; 
    options_outer_counter++;}
  }
  display.fillRoundRect(120,scroll_bar_place,5,20,5,WHITE);} // print the actual scroll bar
  



 // if(selecT == "pressed" && options_outer_counter == 0 && block_cursor == 0 && options_select_mode == 0){ //entering the first option
   // options_select_mode = 1;  // each one represents an option 
   // last_press_time = millis(); // for not regestring multiple presses
  //}
 
  if(selecT == "pressed" && options_select_mode == 0){ //entering the first option
    int option_counter_temp = 0;
    option_counter_temp = options_outer_counter*4;
    option_counter_temp += block_cursor ;
    option_counter_temp++ ;
    last_press_time = millis(); // for not regestring multiple presses
    options_select_mode = option_counter_temp;
   // Serial.print(options_select_mode);
  } 

// for getting the date from the server just once when this menu is opened
// not useful :)
/*
if(got_the_date_from_db == false){
      current_get_day_and_month = get();  //update from server
      got_the_date_from_db = true ; // updated! 
    }
*/

// first option menu (end & upload)
  if(options_select_mode == 1){ //first menu + updated date
  if(rtc_time_updated == false && millis() > last_press_time + 100){
    last_select_mode = select_mode;
    select_mode = 5;
    error_message_text = "please update time";
    options_select_mode = 0;
    last_press_time = millis();
  }
    int day_of_upload = 1;
    int day_of_upload_1 = rtc.getTime("%d").toInt(); //the current real-time day (stored in a var to reduce cpu cycles)
    int day_of_upload_2 = rtc.getTime("%d").toInt() - 1 ; //the other day of upload
    int month_of_upload = rtc.getTime("%m").toInt(); //the current real-time month (stored in a var to reduce cpu cycles)
    int year_of_upload = rtc.getTime("%Y").toInt();
    display.setTextColor(WHITE,BLACK);  //for not transperant bg
    bool done_uploading = false;  // flag to leave the upload menu
    time_critical = true ;  // flag to not turn off the screen while uploading
    //this is for calculating the previous day when the day is 1 (1 - 1 = 0 that's wrong)
    if(day_of_upload_1 == 1){
      if(month_of_upload == 5 || month_of_upload == 7 || month_of_upload == 10 || month_of_upload == 12){
        day_of_upload_2 = 30 ;  //months with 31 days
        month_of_upload -- ;  // change month
      }
      else if(month_of_upload == 3){  //february
        if( ((rtc.getTime("%Y").toInt()%4 == 0) && (rtc.getTime("%Y").toInt() % 100 != 0) ) || rtc.getTime("%Y").toInt() % 400 == 0){ //test if the year is a leap year
          day_of_upload_2 = 29; // leap
          month_of_upload -- ;  // change month
        }
        else{
          day_of_upload_2 = 28; //normal
          month_of_upload -- ;  // change month
        }
      }
      else{
        day_of_upload_2 = 31 ;  //months that are 30 days
        if(month_of_upload == 1){
          year_of_upload -- ;
          month_of_upload = 12;
        }
        else{
        month_of_upload -- ;  // change month 
        }
      }
    }





   //*********************
    bool chose_date = false;    // for navigating between the choosing menu and the actual upload menu
    if(chose_date == false){    // ****the choosing menu****
      display.clearDisplay();
      //not useful
     //  int current_get_day_of_month = current_get_day_and_month.substring(0,current_get_day_and_month.indexOf(",")).toInt();   
      // int current_get_month = current_get_day_and_month.substring(current_get_day_and_month.indexOf(",")+1,current_get_day_and_month.length()).toInt();
      //////////////////
      display.setCursor(5,0);
      display.setTextSize(2);
      display.print("Select Day");
      display.setCursor(35,20);
      display.setTextSize(1);
      display.print("of upload");
      //right set

      display.setTextSize(2);
      display.setCursor(5,40);
      display.print(rtc.getTime("%d")); //current day from rtc
      display.setTextSize(1);
      display.setCursor(30,45);
      display.print("/");
      display.print(rtc.getTime("%02m"));


      display.setTextSize(2);
      display.setCursor(75,40);
      char temp_day_char_storage[30]; // just temp var for formatting
      sprintf(temp_day_char_storage,"%02i" ,day_of_upload_2); // format the printing message
      display.print(temp_day_char_storage);
      display.setTextSize(1);
      display.setCursor(100,45);
      display.print("/");
      char temp_month_print[30];
      sprintf(temp_month_print,"%02i",month_of_upload);
      display.print(temp_month_print);
      if(right == "pressed" && get_date_cursor == 0){ //change the chosen date
      get_date_cursor = 1;
      }
      else if(left == "pressed" && get_date_cursor == 1){
         get_date_cursor = 0;
     }

      if(get_date_cursor == 0){ // draw the line accordingly
         display.drawLine(10,60,40,60,WHITE);
      }
      else if(get_date_cursor == 1){
        display.drawLine(80,60,110,60,WHITE);
      }
      
