Osmax-Br/time_keeper_esp32/main.cpp
        if(get_date_cursor == 0){ // set the day of upload
          day_of_upload = day_of_upload_1;  //right (rtc day)
        }
        else if(get_date_cursor == 1){
          day_of_upload = day_of_upload_2; //left (rtc day -1)
        }
        
      if(selecT == "pressed" && millis() > last_press_time + 100 ){ //switch to uplaod screen

          last_press_time = millis();
          chose_date = true ; //choosed the date
      }

      /////////////////
      
    }
// **** uploading screen ****
    if(chose_date == true){ //if the date is chosen from the last screen
    display.clearDisplay();
    display.setCursor(5,0);
    display.setTextSize(2);
    display.print("END OF DAY");
    display.setTextSize(1);
    display.setCursor(0,20);
    display.print("Server: ");
    display.print(String(sql_server).substring(7,19)); //the ip address of server
     display.setCursor(20,35);
     display.print("the day : ");
     char temp_date_print[30];
     sprintf(temp_date_print,"%02i/%02i",day_of_upload,month_of_upload);
     display.print(temp_date_print);  // the chosen date of upload (from last screen)
     int activity_print_counter = 0;  // for printing the progress bar on screen
    rgb_display(5);
    paused = true;
    for(int i = 0; i<4 ; i++){  // 4 pages
      for(int j =0 ; j<12 ; j++){ // 12 activities
          post(i,j,day_of_upload,month_of_upload,year_of_upload);      // the actual post function
          display.setCursor(20,55);
         char uplaod_progress_message[20] = ""; // dont know why !
         display.print("uploaded ");
         display.print(activity_print_counter); // progress bar
         display.print("/52");
          display.print(uplaod_progress_message);
          display.display();
          activity_print_counter ++ ; // increase the activity counter
      }
    }
    done_uploading = true; // finished uploading (exit screen)
    portENTER_CRITICAL_ISR(&timerMux); // for stopping other functions of changing this value at the same time
    memset(data_storage, 0, sizeof(data_storage));
    portEXIT_CRITICAL_ISR(&timerMux);
    display.display();
    
   if((selecT == "pressed" && millis() > last_press_time + 2000) || done_uploading == true){  // either the process is aborted or it finished
    //got_the_date_from_db = false;
    time_critical = false ; // you can turn the screen off
    options_select_mode = 0;  // go to options menu
    last_press_time = millis();
  }}
  
  }

if(options_select_mode == 12){
  display.clearDisplay();
  if(select_mode == 4 && right == "pressed" && options_select_mode == 12 && current_rgb != 7){
   current_rgb ++;
}
if(select_mode == 4 && options_select_mode == 12 && left == "pressed" && current_rgb != 0){
   current_rgb --;
}
  rgb_display(current_rgb);
  display.setCursor(30,10);
  display.setTextColor(WHITE);
  display.setTextSize(2);
  display.print(rgb_values_name[current_rgb]);
  display.setCursor(15,40);
  display.setTextSize(1);
  display.printf("(%i ,  %i ,  %i)",rgb_values[current_rgb][0],rgb_values[current_rgb][1],rgb_values[current_rgb][2]);
  display.display();
}


int address_num1 = 1;
int address_num2 = 11;
if(options_select_mode == 8){
    display.setCursor(30,0);
    display.setTextSize(1);
    display.setTextColor(WHITE);
    display.print("192.168.");
    display.setTextSize(2);
    display.print("1.11");

}



if(options_select_mode == 11){
    display.clearDisplay();
    display.setTextColor(WHITE);
    display.setTextSize(1);
    display.setFont(NULL);
    display.setCursor(0, 0);
    display.println("do you want to reset?");
    display.setCursor(23, 15);
    display.setFont(&FreeMonoBoldOblique9pt7b);
    display.print(chosen_value);
    display.setFont(&FreeMono9pt7b);
    display.setCursor(20, 40);
    display.printf("%02i:%02i:%02i",data_storage[current_page][data_storage_index][2],data_storage[current_page][data_storage_index][1],data_storage[current_page][data_storage_index][0]);
    display.setFont(NULL);
    if(ok_cancel_button == false){
    display.fillRoundRect(20, 45, 40, 15, 3, WHITE);
    display.setCursor(23, 48);
    display.setTextColor(BLACK);
    display.print("Cancel");
    display.setTextColor(WHITE);
    display.drawRoundRect(70, 45, 40, 15, 3, 1);
    display.setCursor(84, 48);
    display.print("ok");}
    else if(ok_cancel_button == true){
    display.drawRoundRect(20, 45, 40, 15, 3, 1);
    display.setCursor(23, 48);
    display.setTextColor(WHITE);
    display.print("Cancel");
    display.fillRoundRect(70, 45, 40, 15, 3,WHITE);
    display.setCursor(84, 48);
    display.setTextColor(BLACK);
    display.print("ok");
    }




    if(left == "pressed" && ok_cancel_button == true){
      ok_cancel_button = false;
    }
    if(right == "pressed" && ok_cancel_button == false){
      ok_cancel_button = true;
    }

    if(ok_cancel_button == false && selecT == "pressed" && millis() > last_press_time + 100){
      ok_cancel_button = true;
      last_press_time = millis();
      options_select_mode = 0;
    }
    else if(ok_cancel_button == true && selecT == "pressed"&& millis() > last_press_time + 100){
      if(chosen_value == "Nothing"){
          last_select_mode = select_mode;
          select_mode = 5;
          error_message_text = "choose an activity";
          options_select_mode = 11;
          last_press_time = millis();
      }
      else{
       portENTER_CRITICAL_ISR(&timerMux); // for stopping other functions of changing this value at the same time
       data_storage[current_page][data_storage_index][0] = 0 ;
       data_storage[current_page][data_storage_index][1] = 0 ;
       data_storage[current_page][data_storage_index][2] = 0 ;
       portEXIT_CRITICAL_ISR(&timerMux);
       paused = true ;
       last_press_time = millis();
       options_select_mode = 0;
      }

    }


    display.display();
}



if(options_select_mode >= 2 && options_select_mode != 12 && options_select_mode != 11){
    last_select_mode = select_mode;
    select_mode = 5;
    error_message_text = "not done yet";
    options_select_mode = 0;
    last_press_time = millis();
}




